Catalogs/РесурсныеСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РесурсныеСпецификации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновноеИзделиеВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновноеИзделиеНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСпецификаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыходныеИзделия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МатериалыИУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяКалькуляции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ТТМ_ПроверенныеСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТТМ_ПроверенныеСпецификации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпецификацияПроверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТМ_ПланПроизводства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РесурсныеСпецификации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Перем ПроверкаДоступна;

&НаСервере     
//Создание РЕквизитов Формы
//
Процедура АРМ1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Создадим реквизиты формы для хранения данных о проверке спецификации 
	//ТТМ_Проверена    
	//Создаем Элементы для отображения данных о проверке спецификации
	//ТТМ_Проверена (Поле флажка)
	//ТТМ_Проверил (Поле надписи)
	//ТТМ_ДатаПроверки (Поле надписи)  
	ПроверкаДоступна = РольДоступна("ПолныеПрава") или РольДоступна("ТТМ_ПроверкаСпецификаций");
		
	//1. Добавим реквизитФормы
	ДобавляемыеРеквизиты = Новый Массив; 
	
	Если Не ТТМ_ОбщегоНазначения.ЕстьРеквизит("ТТМ_Проверена",ЭтотОбъект) Тогда
		ТипРеквизита = Новый ОписаниеТипов("Булево");//"Строка");
		РеквизитФормы = Новый РеквизитФормы(
			"ТТМ_Проверена",  //Имя реквизита формы
			ТипРеквизита,     //Тип
			"",               //Путь  (Пусто, "Объект", ИмяТЧ) // например "Объект.Товары"
			"Спецификация проверена");	  //Заголовок
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);		
		//Непосредственно создаем новые реквизиты формы
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		Группа = Элементы.Найти("ГруппаДополнительноЛево");
		ПолеПроверена = Элементы.Добавить("ТТМ_Проверена", Тип("ПолеФормы"),Группа);
		ПолеПроверена.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеПроверена.ПутьКДанным = "ТТМ_Проверена";  
		ПолеПроверена.УстановитьДействие("ПриИзменении","ТТМ_ПолеПроверенаПриИзменении");
		
		ПолеПроверил = ЭтаФорма.Элементы.Добавить("ТТМ_Проверил", Тип("ДекорацияФормы"),Группа);    
		ПолеПроверил.ЦветТекста = ЦветаСтиля.ЦветРамкиКнопки;
		
		ПолеДатаПроверки = Элементы.Добавить("ТТМ_ДатаПроверки", Тип("ДекорацияФормы"), Группа); 
		ПолеДатаПроверки.ЦветТекста = ЦветаСтиля.ЦветРамкиКнопки;   
		ПолеПроверил.Доступность = Ложь;
		ПолеДатаПроверки.Доступность = Ложь;
	КонецЕсли;
	
	Если не ПроверкаДоступна Тогда 
		ПолеПроверена.Доступность = Ложь;
	КонецЕсли;
	
	ТаблицаМатериалов = Элементы.Найти("МатериалыИУслуги");
	Если Не ТаблицаМатериалов = Неопределено Тогда
		КоманднаяПанельМатериалов = ТаблицаМатериалов.КоманднаяПанель;
		
		КомандаЗагрузки = Команды.Найти("ТТМ_ЗагрузитьМатериалыПоДаннымТаблицы");
		Если КомандаЗагрузки = Неопределено Тогда
			КомандаЗагрузки = Команды.Добавить("ТТМ_ЗагрузитьМатериалыПоДаннымТаблицы");
			КомандаЗагрузки.Заголовок = "Загрузить по данным таблицы";
			КомандаЗагрузки.Действие = "ТТМ_ЗагрузитьМатериалыПоДаннымТаблицы";
			КомандаЗагрузки.Подсказка = "Заполнить материалы спецификации по колонкам Код номенклатуры и Количество";
			КомандаЗагрузки.Отображение = ОтображениеКнопки.Текст;
		КонецЕсли;
		
		Если Элементы.Найти("ТТМ_ЗагрузитьМатериалыПоДаннымТаблицы") = Неопределено Тогда
			КнопкаЗагрузки = Элементы.Добавить("ТТМ_ЗагрузитьМатериалыПоДаннымТаблицы", Тип("КнопкаФормы"), КоманднаяПанельМатериалов);
			КнопкаЗагрузки.ИмяКоманды = "ТТМ_ЗагрузитьМатериалыПоДаннымТаблицы";
		КонецЕсли;
		
		Если Элементы.Найти("ТТМ_ОткрытьНоменклатуру") = Неопределено Тогда
			КомандаОткрытьНоменклатуру = Команды.Добавить("ТТМ_ОткрытьНоменклатуру");
			КомандаОткрытьНоменклатуру.Заголовок = "Материал";
			КомандаОткрытьНоменклатуру.Действие = "ТТМ_ОткрытьНоменклатуру";
			КомандаОткрытьНоменклатуру.Подсказка = "Открыть материал";
			КомандаОткрытьНоменклатуру.Отображение = ОтображениеКнопки.Текст;

			КнопкаОткрытьНоменклатуру= Элементы.Добавить("ТТМ_ОткрытьНоменклатуру", Тип("КнопкаФормы"), КоманднаяПанельМатериалов);
			КнопкаОткрытьНоменклатуру.ИмяКоманды = "ТТМ_ОткрытьНоменклатуру";
		КонецЕсли;

	КонецЕсли;
	
	//2. Заполним сведения о проверке    
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТТМ_ПроверенныеСпецификацииСрезПоследних.Период КАК ДатаПроверки,
	               |	ТТМ_ПроверенныеСпецификацииСрезПоследних.Спецификация КАК Спецификация,
	               |	ТТМ_ПроверенныеСпецификацииСрезПоследних.СпецификацияПроверена КАК СпецификацияПроверена,
	               |	ТТМ_ПроверенныеСпецификацииСрезПоследних.Проверил КАК Проверил
	               |ИЗ
	               |	РегистрСведений.ТТМ_ПроверенныеСпецификации.СрезПоследних(&МоментВремени, Спецификация = &Спецификация) КАК ТТМ_ПроверенныеСпецификацииСрезПоследних";
	Запрос.УстановитьПараметр("МоментВремени", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Спецификация", Этаформа.Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать(); 
	Выборка.Следующий();    
	Если не ПроверкаДоступна Тогда      
		УстановитьЗначенияДанныхПроверки(Выборка.СпецификацияПроверена, Выборка.Проверил, Выборка.ДатаПроверки);
	Иначе
		Если Выборка.Количество() = 0 Тогда 
			УстановитьЗначенияДанныхПроверки(Ложь,Пользователи.АвторизованныйПользователь(),Формат(ТекущаяДатаСеанса(),"ДФ=dd.MM.yyyy"));
		Иначе 
			Если не Выборка.СпецификацияПроверена Тогда
				УстановитьЗначенияДанныхПроверки(Ложь,Пользователи.АвторизованныйПользователь(),Формат(ТекущаяДатаСеанса(),"ДФ=dd.MM.yyyy"));
			Иначе        
				УстановитьЗначенияДанныхПроверки(Выборка.СпецификацияПроверена, Выборка.Проверил, Выборка.ДатаПроверки);
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры    

 &НаСервере
 Процедура УстановитьЗначенияДанныхПроверки(Проверена, Проверил, Датапроверки)
	ЭтаФорма.ТТМ_Проверена = Проверена;
	Элементы.ТТМ_Проверил.Заголовок = Проверил;
	Элементы.ТТМ_ДатаПроверки.Заголовок = ДатаПроверки;
 КонецПроцедуры
	 
&НаКлиенте
Процедура ТТМ_ПолеПроверенаПриИзменении() 
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере                   
//Расширение данной процедуры решает 2 задачи:
//1. Запись данных о проверке спецификации
//2. Прописать Спецификацию в Заказах на производство, где она отсутствует
//
Процедура АРМ1_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	//1. Записать данные о ПРОВЕРКЕ СПЕЦИФИКАЦИИ в регистр, если необходимо 
	ПроверкаДоступна = РольДоступна("ПолныеПрава") или РольДоступна("ТТМ_ПроверкаСпецификаций");
	Если ПроверкаДоступна Тогда 
		ЗаписатьДанныеПроверкиВРегистр(ЭтаФорма.ТТМ_Проверена);
	КонецЕсли;
	
	//2. пропишем спецификацию в Заказак на производство, где Спецификация не указана  
	Если не ТекущийОбъект.Статус = Перечисления.СтатусыСпецификаций.Действует Тогда 
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура,
	               |	РесурсныеСпецификацииВыходныеИзделия.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификацииВыходныеИзделия.Ссылка.ОсновноеИзделиеВидНоменклатуры КАК ОсновноеИзделиеВидНоменклатуры,
	               |	РесурсныеСпецификацииВыходныеИзделия.Ссылка.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
	               |	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК ЗаказНаПроизводствоНоменклатура,
	               |	ЗаказНаПроизводство2_2Продукция.Спецификация КАК ЗаказНаПроизводствоСпецификация,
	               |	ЗаказНаПроизводство2_2Продукция.Ссылка КАК ЗаказНаПроизводство
	               |ИЗ
	               |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ПО (ВЫБОР
	               |				КОГДА ЕСТЬNULL(РесурсныеСпецификацииВыходныеИзделия.Ссылка.ОсновноеИзделиеНоменклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |						И ЕСТЬNULL(ЗаказНаПроизводство2_2Продукция.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	               |					ТОГДА ЗаказНаПроизводство2_2Продукция.Номенклатура = РесурсныеСпецификацииВыходныеИзделия.Ссылка.ОсновноеИзделиеНоменклатура
	               |				КОГДА ЕСТЬNULL(РесурсныеСпецификацииВыходныеИзделия.Ссылка.ОсновноеИзделиеВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	               |						И ЕСТЬNULL(ЗаказНаПроизводство2_2Продукция.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	               |					ТОГДА ЗаказНаПроизводство2_2Продукция.Номенклатура.ВидНоменклатуры = РесурсныеСпецификацииВыходныеИзделия.Ссылка.ОсновноеИзделиеВидНоменклатуры
	               |			КОНЕЦ)
	               |ГДЕ
	               |	РесурсныеСпецификацииВыходныеИзделия.Ссылка = &Ссылка
	               |	И ЗаказНаПроизводство2_2Продукция.Ссылка.Проведен
	               |ИТОГИ ПО
	               |	ЗаказНаПроизводство";  
	Запрос.УстановитьПараметр("Ссылка",ТекущийОбъект.Ссылка);
	ВыборкаЗаказыНаПроизводство = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); //Выгрузить();
	
	Пока ВыборкаЗаказыНаПроизводство.Следующий() Цикл  
		ОбъектЗаказ = ВыборкаЗаказыНаПроизводство.ЗаказНаПроизводство.ПолучитьОбъект();   
		СтрИзделие = ВыборкаЗаказыНаПроизводство.Выбрать(); 
		Пока СтрИзделие.Следующий() Цикл 
			Если ЗначениеЗаполнено(СтрИзделие.Номенклатура) или ЗначениеЗаполнено(СтрИзделие.ОсновноеИзделиеНоменклатура) Тогда 
				КолонкаНоменклатура = "Номенклатура";   
				КолонкаВидНоменклатуры = "";   
				ОбъектПоиска = СтрИзделие.Номенклатура;
			ИначеЕсли ЗначениеЗаполнено(СтрИзделие.ОсновноеИзделиеВидНоменклатуры) Тогда 
				КолонкаНоменклатура = "Номенклатура";   
				КолонкаВидНоменклатуры = "ВидНоменклатуры";   
				ОбъектПоиска = СтрИзделие.ОсновноеИзделиеВидНоменклатуры;
			Иначе 
				Сообщить("В спеццификации не заполнено ни Основное изделиеНоменклатура, ни ОсновноеИзделиеВидНоменклатуры");
			КонецЕсли;                                                 
			Для Каждого СтрПродукция из ОбъектЗаказ.Продукция Цикл  //МассивСтрокПродукции Цикл                      
				ИскомоеЗначение = ?(ЗначениеЗаполнено(КолонкаВидНоменклатуры),СтрПродукция[КолонкаНоменклатура][КолонкаВидНоменклатуры],СтрПродукция[КолонкаНоменклатура]);
				Если ИскомоеЗначение = ОбъектПоиска Тогда
					Если не ЗначениеЗаполнено(СтрПродукция.Спецификация) Тогда 
						СтрПродукция.Спецификация = ТекущийОбъект.Ссылка;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;            
		КонецЦикла;
		
		Попытка
			ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			Сообщить("Ошибка при записи Заказа на производство " + СтрИзделие.ЗаказНаПроизводство);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеПроверкиВРегистр(СпецификацияПроверена)
	
	СсылкаНаСпецификацию = ЭтаФорма.Объект.Ссылка;
	НЗ = РегистрыСведений.ТТМ_ПроверенныеСпецификации.СоздатьНаборЗаписей();
	НЗ.Отбор.Спецификация.Установить(ЭтаФорма.Объект.Ссылка); 
	НЗ.Отбор.Период.Установить(НачалоДня(ТекущаяДатаСеанса()));
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда 
		НЗ.Очистить();
	КонецЕсли;
	
	НоваяСтрока = НЗ.Добавить();
	НоваяСтрока.Спецификация = СсылкаНаСпецификацию;
	НоваяСтрока.Период = НачалоДня(ТекущаяДатаСеанса());
	НоваяСтрока.Проверил = Пользователи.АвторизованныйПользователь();
	НоваяСтрока.СпецификацияПроверена = СпецификацияПроверена;
	
	Попытка
		НЗ.Записать();
	Исключение
		Сообщить("Ошибка записи данных о проверке в регистр сведений " + ОписаниеОшибки());
	КонецПопытки; 
	
	//Запишем данные о проверке в дополнительное сведение
	
	ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","СпецификацияПроверена_2bcff13b79a24cb18fbf92882ce31c4b");
	//СпецификацияПроверена_94e87fffe3214c02839da712f364a57a");
	МЗ = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МЗ.Объект = СсылкаНаСпецификацию;
	МЗ.Свойство = ДопСвойство;
	МЗ.Прочитать();
	
	Если не МЗ.Выбран() Тогда 
		МЗ.Объект = СсылкаНаСпецификацию;
		МЗ.Свойство = ДопСвойство;
		МЗ.Значение = СпецификацияПроверена;
		МЗ.Записать();
	Иначе 
		МЗ.Значение = СпецификацияПроверена;
		МЗ.Записать();
	КонецЕсли;
			
КонецПроцедуры


&НаКлиенте
Процедура ТТМ_ОткрытьНоменклатуру(Команда)
	
	ТекДанные = Элементы.МатериалыИУслуги.ТекущиеДанные;
	Если ТекДанные<>Неопределено Тогда
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("Ключ",ТекДанные.Номенклатура));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТТМ_ЗагрузитьМатериалыПоДаннымТаблицы(Команда)
	
	Если Объект.МатериалыИУслуги.Количество() <> 0 Тогда
		ТекстВопроса = "Таблица материалов и работ будет перезаполнена. Продолжить?";
		Оповещение = Новый ОписаниеОповещения("ТТМ_ЗагрузитьМатериалыПоДаннымТаблицыЗавершение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ТТМ_ПоказатьФормуЗагрузкиМатериаловПоДаннымТаблицы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТТМ_ЗагрузитьМатериалыПоДаннымТаблицыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТТМ_ПоказатьФормуЗагрузкиМатериаловПоДаннымТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТТМ_ПоказатьФормуЗагрузкиМатериаловПоДаннымТаблицы()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РесурснаяСпецификация", Объект.Ссылка);

	Оповещение = Новый ОписаниеОповещения("ТТМ_ПоказатьФормуЗагрузкиМатериаловПоДаннымТаблицыЗавершение", ЭтаФорма);
	ФормаЗагрузки = ПолучитьФорму("ОбщаяФорма.ТТМ_ЗагрузкаМатериаловСпецификацииИзТаблицы", ПараметрыФормы, ЭтаФорма);
	ФормаЗагрузки.ОписаниеОповещенияОЗакрытии = Оповещение;
	ФормаЗагрузки.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ТТМ_ПоказатьФормуЗагрузкиМатериаловПоДаннымТаблицыЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТТМ_ЗагрузитьМатериалыПоДаннымТаблицыНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаКлиенте
Функция ТТМ_ОписаниеКолонокМакетаДляЗагрузкиМатериаловПоДаннымТаблицы()
	
	КолонкиМакета = Новый Массив;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("Штрихкод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)), "Штрихкод", 10);
	Колонка.Позиция = 1;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("Артикул", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)), "Артикул", 10);
	Колонка.Позиция = 2;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("КодНоменклатуры", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20)), "Код номенклатуры", 15);
	Колонка.Позиция = 3;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("Номенклатура", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)), "Номенклатура", 15);
	Колонка.Позиция = 4;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("Характеристика", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)), "Характеристика", 15);
	Колонка.Позиция = 5;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("КоличествоУпаковок", Новый ОписаниеТипов("Число"), "Количество", 10);
	Колонка.Позиция = 6;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("КодУпаковки", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(4)), "Код упаковки", 12);
	Колонка.Позиция = 7;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("Упаковка", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)), "Упаковка", 10);
	Колонка.Позиция = 8;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("СтатьяКалькуляции", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150)), "Статья калькуляции", 17);
	Колонка.Позиция = 9;
	КолонкиМакета.Добавить(Колонка);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета("ПрименениеМатериала", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(0)), "Применение материала", 20);
	Колонка.Позиция = 10;
	КолонкиМакета.Добавить(Колонка);
	
	Возврат КолонкиМакета;
	
КонецФункции

&НаСервере
Процедура ТТМ_ЗагрузитьМатериалыПоДаннымТаблицыНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	Если ЗагруженныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаМатериалов = Новый ТаблицаЗначений;
	ТаблицаМатериалов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаМатериалов.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число"));
	
	НеНайденныеКоды = Новый Массив;
	
	Для Каждого СтрокаДанных Из ЗагруженныеДанные Цикл
		
		КодНоменклатуры = "";
		Попытка
			КодНоменклатуры = СокрЛП(СтрокаДанных.КодНоменклатуры);
		Исключение
			КодНоменклатуры = "";
		КонецПопытки;
		Количество = ?(ЗначениеЗаполнено(СтрокаДанных.КоличествоУпаковок), СтрокаДанных.КоличествоУпаковок, 0);
		
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Попытка
			Если ЗначениеЗаполнено(СтрокаДанных.Номенклатура) Тогда
				Номенклатура = СтрокаДанных.Номенклатура;
			КонецЕсли;
		Исключение
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(Номенклатура) И ПустаяСтрока(КодНоменклатуры) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Номенклатура = ТТМ_НайтиНоменклатуруПоКодуДляЗагрузкиВСпецификацию(КодНоменклатуры);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			НоменклатураТекст = "";
			Попытка
				Если ЗначениеЗаполнено(СтрокаДанных.НоменклатураТекст) Тогда
					НоменклатураТекст = СокрЛП(Строка(СтрокаДанных.НоменклатураТекст));
				Иначе
					НоменклатураТекст = СокрЛП(Строка(СтрокаДанных.Номенклатура));
				КонецЕсли;
			Исключение
				НоменклатураТекст = "";
			КонецПопытки;
			
			Если Не ПустаяСтрока(НоменклатураТекст) Тогда
				Номенклатура = ТТМ_НайтиНоменклатуруПоТекстуДляЗагрузкиВСпецификацию(НоменклатураТекст);
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Если НеНайденныеКоды.Найти(КодНоменклатуры) = Неопределено Тогда
				НеНайденныеКоды.Добавить(?(ПустаяСтрока(КодНоменклатуры), "<пустой код>", КодНоменклатуры));
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаМатериалов.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаМатериалов.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.КоличествоУпаковок = Количество;
		Иначе
			НайденныеСтроки[0].КоличествоУпаковок = НайденныеСтроки[0].КоличествоУпаковок + Количество;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаМатериалов.Количество() = 0 Тогда
		Если НеНайденныеКоды.Количество() > 0 Тогда
			Сообщить("Не найдена номенклатура по кодам: " + СтрСоединить(НеНайденныеКоды, ", "));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Объект.МатериалыИУслуги.Очистить();
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакСерииИспользуются", Новый Структура("Номенклатура", "СерииИспользуются"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу");
	
	ОбрабатываемыеСтроки = Новый Массив;
	Для Каждого СтрокаМатериала Из ТаблицаМатериалов Цикл
		ТекущаяСтрока = Объект.МатериалыИУслуги.Добавить();
		ТекущаяСтрока.Номенклатура = СтрокаМатериала.Номенклатура;
		ТекущаяСтрока.КоличествоУпаковок = СтрокаМатериала.КоличествоУпаковок;
		ПриВводеНовойСтрокиСпецификации(ЭтаФорма, "МатериалыИУслуги", ТекущаяСтрока);
		ОбрабатываемыеСтроки.Добавить(ТекущаяСтрока);
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(ОбрабатываемыеСтроки, СтруктураДействий, Объект.МатериалыИУслуги);
	ЗаполнитьСлужебныеРеквизитыМатериалыИУслуги();
	
	Если НеНайденныеКоды.Количество() > 0 Тогда
		Сообщить("Не найдена номенклатура по кодам: " + СтрСоединить(НеНайденныеКоды, ", "));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТТМ_НайтиНоменклатуруПоКодуДляЗагрузкиВСпецификацию(КодНоменклатуры)
	
	Если ПустаяСтрока(СокрЛП(КодНоменклатуры)) Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И (Номенклатура.КодДляПоиска = &КодНоменклатуры
	|		ИЛИ Номенклатура.Код = &КодНоменклатуры)";
	Запрос.УстановитьПараметр("КодНоменклатуры", СокрЛП(КодНоменклатуры));
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат[0].Номенклатура;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТТМ_НайтиНоменклатуруПоТекстуДляЗагрузкиВСпецификацию(ТекстПоиска)

	ТекстПоиска = СокрЛП(ТекстПоиска);
	Если ПустаяСтрока(ТекстПоиска) Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И (Номенклатура.Код = &ТекстПоиска
	|		ИЛИ Номенклатура.Наименование = &ТекстПоиска
	|		ИЛИ Номенклатура.КодДляПоиска = &ТекстПоиска)";
	Запрос.УстановитьПараметр("ТекстПоиска", ТекстПоиска);

	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат[0].Номенклатура;

КонецФункции
